{"top":{"meta":{"headline":"Ticket to the top","subhead":"How tiny St. Anthony Catholic High School got involved in a questionable recruiting pipeline that included the University of the Incarnate Word, an agent and a booster to land star Nigerian basketball player Charles Bassey, one of the top big men in the country.","byline":"Adam Zuvanich","date":"June 23, 2017"},"image":{"source":"bassey-school.jpg","caption":"St. Anthony's Charles Bassey leaves the school.","cutline":"Edward A. Ornelas / San Antonio Express-News"}},"sections":{"1":[{"type":"intrograph","value":{"text":"It was the best of times, it was the worst of times. Dickens, right? He was a great writer."}},{"type":"text","value":"In a blur, Bassey swooped to the rim, caught his own pass off the glass and slammed down a two-handed dunk that sparked a roar from the crowd in the small St. Anthony Catholic High School gym."},{"type":"text","value":"The Feb. 4 game against Little Rock’s Southwest Christian Academy demonstrated why the Nigerian sophomore, nicknamed “Big Ticket,” is one of the best big men in high school basketball and a top prospect already in the sights of college powers Kansas, Arizona, Washington and Texas A&M — schools Bassey said have offered him a scholarship."},{"type":"photo","value":{"source":"dunk.jpg","caption":"Jackets big man Charles Bassey throws down a slam as Central Catholic plays St. Anthony in boys basketball at Greehey Arena on January 21, 2016.","cutline":"Tom Reel / San Antonio Express-News","type":"small-left"}},{"type":"text","value":"How Bassey ended up at St. Anthony — a historic private school in Monte Vista north of downtown — sheds light on an international recruiting effort that involves the University of the Incarnate Word, a wealthy former trustee of the university, and an agent who runs a nonprofit that advertises itself as a conduit for foreign athletes seeking an education in the United States."},{"type":"text","value":"The recruitment of Bassey and other international athletes to San Antonio — the public charter Athlos Academy also enrolled players through the nonprofit — also illustrates how foreign recruiting has filtered down from the college level to high school sports as coaches, agents and donors seek to identify and groom top players for Division I college teams, and eventually the NBA."},{"type":"text","value":"While enrolling foreign players isn’t unusual, high schools, like colleges, can be sanctioned if they provide improper financial incentives to the athletes. St. Anthony — a small school of 355 students in the Archdiocese of San Antonio and never before considered a basketball power — ran afoul of the rules last fall."},{"type":"text","value":"Bassey, 16, arrived at St. Anthony as a freshman in the summer of 2015-16, leading the team to a 32-6 record and an appearance in the state championship game within the Texas Association of Private and Parochial Schools a year after it had a losing record of 7-15."},{"type":"text","value":"St. Anthony enrolled five more international players last year, sparking an investigation by TAPPS, which found that Bassey and at least one other foreign player received improper financial support and ruled them ineligible to play. Undeterred, St. Anthony ended its 19-year association with TAPPS and joined the San Antonio-based Texas Christian Athletic League, which placed the Yellow Jackets in a boys basketball division that allows teams to recruit foreign players and provide scholarships."},{"type":"photo","value":{"source":"international-benched.jpg","caption":"Ousmane Ndim, Charles Bassey and Obi Prosper in St. Anthony's Alumni Tournament on Thursday, November 17, 2016. Four players were not able to compete from a ruling from their league.","cutline":"Ronald Cortes / Freelance for Express-News","type":"full"}},{"type":"text","value":"St. Anthony then competed in national showcase tournaments last season and, through its new affiliation, played against other basketball powers from Texas and other states. The schools play as independents or are in non-traditional leagues that, like TCAL, permit financial inducements that normally would exclude the teams from traditional high school leagues."},{"type":"text","value":"Acquiring a good education in the U.S. is part of the pitch to promising foreign athletes. But some players brought to San Antonio have drifted from school to school to make their mark. St. Anthony was the third high school in as many years for two of Bassey’s teammates — star guard Sam Chaput from Canada and 7-foot center Ousmane Ndim from Senegal."},{"type":"text","value":"Founded in 1903 by the Oblates of Mary Immaculate as a junior seminary, St. Anthony has been managed by the University of the Incarnate Word since 1995, when it became a high school for boys. It opened enrollment to girls starting in 2003."},{"type":"text","value":"The private Catholic university and St. Anthony are affiliated with the Sisters of Charity of the Incarnate Word, a religious order within the archdiocese. The religious order and archdiocese would not comment on St. Anthony’s recruitment of foreign athletes."},{"type":"slideshow","value":[{"source":"http://ww1.hdnux.com/photos/62/37/65/13237588/3/rawImage.jpg","caption":"A helicopter surveys the bus submerged in the Guadalupe River after the July 17, 1987 flood that killed 10 teenagers near Comfort, Texas.","cutline":"Express-News file photo"},{"source":"http://ww4.hdnux.com/photos/62/37/65/13237587/3/rawImage.jpg","caption":"Campers wait after being rescued from the floodwaters near Comfort, Texas.","cutline":"Express-News file photo"},{"source":"http://ww2.hdnux.com/photos/62/37/65/13237589/3/rawImage.jpg","caption":"First responders used helicopters to rescue children clinging to trees.","cutline":"Express-News file photo"},{"source":"http://ww2.hdnux.com/photos/62/37/65/13237585/3/rawImage.jpg","caption":"A rescue worker begins removing the sunken bus that carried children from Seagoville Road Baptist Church from the Guadalupe River.","cutline":"Express-News file photo"},{"source":"http://ww3.hdnux.com/photos/62/37/65/13237586/3/rawImage.jpg","caption":"Rescue workers recover the bus that was carrying children from Seagoville Road Baptist Church away from the Pot O' Gold Ranch.","cutline":"Express-News file photo","quote":"Wherever he goes, there would be a lot of questions that need to be answered."}]}],"2":[{"type":"sectionheading","value":"Agent gets involved"},{"type":"text","value":"Bassey’s trail to San Antonio was carved by Hennssy Auriantal, a Canadian from Montreal and former basketball player at the University of Wisconsin who worked as an assistant coach at Jackson State University in Mississippi."},{"type":"text","value":"St. Anthony hired him as an athletic coordinator in 2015-16."},{"type":"text","value":"Auriantal, who has declined multiple interview requests with the Express-News, previously said he had a pre-existing relationship with Bassey and brought him to campus."},{"type":"text","value":"Jurenovich, speaking on behalf of St. Anthony, said Auriantal was hired by St. Anthony as a potential coach, recruiter of international students and student-affairs liaison for the high school’s 42 international boarding students."},{"type":"photo","value":{"source":"auriantal.jpg","caption":"St. Anthony assistant coach Hennssy Auriantal (center) talks with players Charles Bassey (left) and Obi Prosper before a game in Garden City, NY.","cutline":"Edward A. Ornelas / San Antonio Express-News","type":"small-right"}},{"type":"text","value":"Auriantal also is director of a Dallas-based nonprofit called Yes II Success that provides a “unique educational scholarship program in the United States ... to facilitate the transition of international students,” into the country, according to its Facebook page."},{"type":"text","value":"An online presentation by Yes II Success on emaze.com outlines its plan to select international students based on their “academics, skill, athleticism, and physical strength,” along with managing their careers from the high school through professional levels."},{"type":"text","value":"The plan states prospective international students must provide guardianship and power of attorney to the organization, which will “maintain total control of all decisions,” such as where the students attend school and their college recruitment."},{"type":"subscribe","value":{}},{"type":"text","value":"Jackson State head basketball coach Wayne Brent, who had Auriantal on his staff for two years, said the international connections he used to bring players to the U.S. was among the reasons he was hired. Brent said he fired Auriantal partly because none of his international players ended up at Jackson State."},{"type":"text","value":"“He was always on the phone, always trying to help kids get over here. He didn’t care what high school they went to,” Brent said. “He would find a kid a place to go, and the place to go would be prep schools that would put kids on scholarships. He would do that all the time.”"},{"type":"text","value":"A small high school in San Antonio might be an unusual place to land for a former college assistant. But Auriantal had connections to the city through his relationship with Dallas developer Mike Beucler, a former Incarnate Word trustee whose son Evan was a sophomore backup guard on the basketball team last season."},{"type":"text","value":"Yes II Success, which also sponsors an AAU summer basketball team, filed a 2014 corporate registration in Dallas. Auriantal was named as the director, using the same address as Beucler Properties. The registration has since lapsed, according to state records. Nonprofits must make their annual tax records available to the public. But a search in a public database of nonprofits turned up no records for Yes II Success."},{"type":"pullquote","value":{"quote":"He would find a kid a place to go, and the place to go would be prep schools that would put kids on scholarships. He would do that all the time."}},{"type":"text","value":"Beucler, 65, who declined to speak on the record in a phone interview, has long had athletic and business interests in San Antonio. Auto magnate Ernesto Ancira, who served on the Incarnate Word board with Beucler until they both stepped down last year, said they also were on the board at Dominion Country Club in the 1980s, with Beucler helping the club land the PGA Champions Tour event held in San Antonio from 1985-2015."},{"type":"text","value":"In 2013, BC Realty Partners, for which Beucler was principal, proposed a 26-story high-rise hotel atop the Joske’s building on Alamo Plaza. The city’s Historic and Design Review Commission rejected the proposal because it did not conform to the area’s established design pattern and would have cast winter shadows on the Alamo."},{"type":"text","value":"A source close to the Incarnate Word administration, who asked not to be named, said Beucler discussed a plan to bring international basketball players to St. Anthony in 2015."},{"type":"text","value":"Ancira said Beucler “was the (trustee) that was most involved in athletics. He took a real interest.”"},{"type":"photo","value":{"source":"calderon.jpg","caption":"St. Anthony director of enrollment Alejandro Calderon talks with student Charles Bassey after class.","cutline":"Edward A. Ornelas / San Antonio Express-News","type":"small-right"}},{"type":"text","value":"Bassey arrived that summer for his freshman year. Alejandro Calderon, St. Anthony’s director of enrollment, confirmed the Beucler Family Partnership guaranteed Bassey’s school expenses on the immigration paperwork he used to obtain his student visa. The registered agents for the partnership, according to state records, are Beucler’s wife, Shelli, and son, Reid."},{"type":"text","value":"It is unclear who covered the costs of St. Anthony’s other foreign players."},{"type":"text","value":"The total cost to attend the school as an international boarding student, according to the St. Anthony website, is more than $38,000 per year."},{"type":"text","value":"Ancira also said Mike Beucler, who played basketball at Texas Lutheran University in Seguin, is an athletic booster for Incarnate Word."},{"type":"text","value":"Jurenovich said Beucler was “instrumental in developing” the annual wild game dinner that serves as a fundraiser for the men’s basketball team."}],"3":[{"type":"sectionheading","value":"Joining the national ranks"},{"type":"text","value":"When St. Anthony opened its basketball season with a host tournament on Nov. 17, it already was under investigation by TAPPS for enrolling Bassey and the five new international players who arrived after him — Chaput, Ndim, Nigerians Franklin Agunanne and Obi Prosper, and Canadian Jordan Persad."},{"type":"text","value":"Earlier that day, then-St. Anthony Principal Rene Escobedo said in a statement that “two ineligible students sponsored by a charitable organization for tuition, room and board have been viewed by TAPPS as inducement through the school despite clear evidence to the contrary.”"},{"type":"text","value":"Escobedo, who since has transferred to Holy Cross high school, later identified those students as Bassey and Chaput and said both lived in dorms on the campus of Incarnate Word High School, which also is managed by the university. Escobedo said Persad, a freshman, was ruled ineligible by TAPPS because he previously competed for a junior national team."},{"type":"photo","value":{"source":"bassey-block.jpg","caption":"A hard night on the floor ends for Buttons center Nathan Payet as Jackets big man Charles Bassey rejects his shot in the lane as Central Catholic plays St. Anthony in boys basketball at Greehey Arena on January 21, 2016.","cutline":"Tom Reel / San Antonio Express-News","type":"small-left"}},{"type":"text","value":"Calderon said Agunanne began the school year at St. Anthony. A 6-foot-9 junior forward, he later transferred to La Lumiere School in Indiana, an independent that plays schools around the country."},{"type":"text","value":"Agunanne and another one of Beucler’s sons, Grant Beucler, a junior guard for La Lumiere, helped the team end the season this year by winning the title at the DICK’s Sporting Goods High School Nationals."},{"type":"text","value":"Less than a week before leaving TAPPS for TCAL, St. Anthony fired basketball coach Jeff Merritt for inserting Bassey into a Nov. 29 home game even though he was ineligible. Merritt was in his first season with the Yellow Jackets after previously serving as an assistant coach at La Lumiere."},{"type":"text","value":"Jurenovich described the league switch as unrelated to the basketball team. He said TAPPS had denied repeated St. Anthony requests to compete in a lower classification because it had a smaller enrollment than its counterparts and struggled to compete in multiple sports."},{"type":"text","value":"“Never had request to play down,” TAPPS Executive Director Bryan Bunselmeyer said in a text message."},{"type":"text","value":"St. Anthony played up after leaving TAPPS, which had placed the school in a division that included local schools Central Catholic and Antonian Prep, as well as St. Joseph Academy in Brownsville."},{"type":"text","value":"With its foreign players unleashed in the Texas Christian Athletic League, St. Anthony played a regional and national schedule last season, competing against some of the country’s top preparatory programs and players at showcases in Florida, Kentucky, Massachusetts, New York and South Dakota."},{"type":"text","value":"Former interim coach Casey Barksdale, who replaced Merritt after he was fired, said St. Anthony was invited to those events and received stipends to help cover travel expenses because of Bassey."},{"type":"text","value":"Athlos Academy, the local public charter school, also is a member with St. Anthony in TCAL’s 4A division, which the league established for basketball powers. Auriantal’s brother, Ralph Auriantal, is an assistant basketball coach at Athlos."},{"type":"photo","value":{"source":"barksdale.jpg","caption":"St. Anthony head coach Casey Barksdale huddles with the team during the game against Southwest Christian held Saturday Jan. 21, 2017 at Athlos Leadership Academy.","cutline":"Edward A. Ornelas / San Antonio Express-News","type":"full"}},{"type":"text","value":"Other schools in the division include Southwest Christian, two Houston schools — Chris Walker Academy and Pro-Vision School — and Life Preparatory Academy in Wichita, Kansas."},{"type":"text","value":"St. Anthony’s international players all took the court in February against Southwest Christian, which head coach Charles Baker said is barred from competing against schools in the Arkansas Activities Association, the state’s main prep league."},{"type":"text","value":"Baker said more than half of the 12 players on the Lions’ roster were international. He also said nine of those players are Division I college prospects."},{"type":"text","value":"Southwest Christian is excluded from the Arkansas Activities Association because it has boarding students, association executive director Joey Walters said."}],"4":[{"type":"sectionheading","value":"Custody dispute over Bassey"},{"type":"text","value":"With Bassey’s growing reputation as a future star — he averaged about 22 points, 17 rebounds and six blocked shots per game last season — Hennssy Auriantal followed through with the plan stated by his nonprofit to gain custody of him."},{"type":"text","value":"Last December, Auriantal and his wife, Nathalie Romao, petitioned Bexar County District Court to become Bassey’s legal guardians. According to the petition, Auriantal and Romao had “actual care, control and possession” of Bassey for at least six months."},{"type":"text","value":"It also stated that the couple expected to enter in an agreement with Bassey’s father in Nigeria, Akpan Ebong Bassey."},{"type":"text","value":"A waiver of service notarized in Nigeria, and bearing a signature, address and two phone numbers for Bassey’s father, was filed in court Jan. 11."},{"type":"text","value":"But on March 16, an objection was filed by a Nigerian attorney claiming to represent Bassey’s father. The letter of objection states Akpan Bassey is illiterate and signed the waiver of service under false pretenses. It also says Bassey’s father did not want to enter into a guardianship agreement with Auriantal and Romao."},{"type":"photo","value":{"source":"bassey-call.jpg","caption":"St. Anthony's Charles Bassey looks for a call during the game against Southwest Christian held Saturday Jan. 21, 2017 at Athlos Leadership Academy.","cutline":"Edward A. Ornelas / San Antonio Express-News","type":"small-left"}},{"type":"text","value":"Also filed was a power of attorney document, dated Feb. 5, 2016, stating Bassey’s father granted management rights for his son to John Faniran, who runs basketball tournaments in Nigeria and said he helped Bassey get a scholarship at a Nigerian private school for two years before he came to San Antonio."},{"type":"text","value":"Faniran said he reached an agreement with Auriantal to find an American school for Bassey and his son, B.J. Faniran, who also enrolled at St. Anthony in 2015-16, was a senior this year and played basketball and football at the school."},{"type":"text","value":"B.J. Faniran also has been featured in Yes II Success social media posts, one of which says he received a scholarship offer from the Incarnate Word football program. John Faniran confirmed his son received an offer but said it was pulled before national signing day in February."},{"type":"text","value":"When reached by phone on March 7, a man who answered one of the Nigerian numbers listed for Bassey’s father said, “Someone take my son Charles. I want to come see him. He lost his mother ... I’m still worried.”"},{"type":"text","value":"On March 31, Bexar County Judge Antonia Arteaga granted Auriantal and his wife custody of Bassey. A lawyer hired by Faniran to represent Bassey’s father is appealing the decision."},{"type":"text","value":"Unstated in the custody dispute is the money Bassey and his agent stand to earn if he becomes a high NBA draft pick. Top players in recent drafts have signed rookie contracts for more than $20 million."},{"type":"pullquote","value":{"quote":"Someone take my son Charles. I want to come see him. He lost his mother ... I’m still worried."}},{"type":"text","value":"Because he plays for a U.S. school, Bassey has to be at least 19 years old and one year removed from high school to qualify for the NBA draft. Foreign stars who play outside the U.S. can enter the draft straight out of high school. In 2016, Thon Maker, a 7-foot-1 Sudanese forward who played prep basketball in Canada, was the 10th pick in the draft out of high school and signed a rookie contract with the Milwaukee Bucks estimated to be worth more than $5 million over two years."},{"type":"text","value":"With his skill set, Bassey could be compared to Ben Simmons, the No. 1 pick in 2016. An Australian 6-foot-10 forward, Simmons played prep basketball at Montverde Academy in Florida. He played one year of college ball at Louisiana State University then entered the NBA draft, becoming the ultimate “one-and-done” college player. Drafted by the Philadelphia 76ers, he signed a rookie contract estimated by Forbes to be worth more than $26 million over four years."},{"type":"text","value":"Bassey’s presence at St. Anthony already has paid dividends for the school and Yes II Success."},{"type":"text","value":"In February 2016, Yes II Success signed a $20,000 sponsorship contract with adidas. The deal came a week after St. Anthony signed a term sheet with the apparel maker for an undisclosed amount, according to a copy of the contract. Incarnate Word said in a 2015 release that it had signed a seven-year sponsorship agreement with adidas."},{"type":"text","value":"Anthony Coleman, an assistant men’s basketball coach at Arizona State, was the adidas Sports Marketing representative named on the agreements with St. Anthony and Yes II Success. Coleman confirmed he put the deals together, but was not involved in the agreement with Incarnate Word. He said he reached out to St. Anthony because it had an up-and-coming program."},{"type":"text","value":"When asked if Bassey was a factor in seeking the sponsorship agreements, Coleman said, “I would assume so. He’s top five in the country.”"}],"5":[{"type":"sectionheading","value":"Tourney MVP"},{"type":"text","value":"Bassey, after missing the final month of St. Anthony’s season with an injury, has continued to showcase his talent in San Antonio and beyond. He played in the Underclassman All-American Game on March 26 in Georgia and was featured on the event’s internet home page."},{"type":"text","value":"According to a Yes II Success Twitter post, he was named most valuable player after racking up 35 points, 20 rebounds and six blocked shots for the East team."},{"type":"text","value":"With college coach John Calipari of Kentucky on hand during adidas’ “Gauntlet” series in Dallas in April, Bassey was physically imposing in the post, throwing down dunks and swatting away shots on defense. He also flashed more finesse."},{"type":"photo","value":{"source":"team-tournament.jpg","caption":"Ousmine Ddim (05), Charles Bassy (23) and Sam Chaput (33) of St. Anthony Catholic High School joins other players from the \"Yes II Success\" basketball team to play in a tournament on April 14, 2017. The team consisted of players from St. Anthony's Catholic High School.","cutline":"Kin Man Hui / San Antonio Express-News","type":"full"}},{"type":"text","value":"Bassey made mid-range jumpers, finished with both hands near the rim and found open teammates with passes. He also ran a fast break, grabbing a rebound and dribbling the length of the floor before making an on-the-run bounce pass to a teammate on the perimeter."},{"type":"text","value":"More events await Bassey and the Yes II Success team on summer AAU circuits, which is prime recruiting ground for college coaches."},{"type":"text","value":"“They all want Charles,” Calderon said. “Everybody wants Charles.”"},{"type":"text","value":"Bassey hasn’t received a scholarship offer from Incarnate Word. Jurenovich, the Incarnate Word vice president, said it would be unrealistic to expect a player of Bassey’s caliber to end up with the Cardinals."},{"type":"credits","value":[{"credit":"adam.zuvanich@express-news.net"},{"credit":"Twitter: @AZuvanich"}]}]}}